using System;

namespace laba8
{
    class Program
    {
        static void Main(string[] args)
        {

            var вооруж = new Вооружение("Россия", "Пм", 0.755, 9.18);
            var стрелк1 = new Стрелковое("Россия", "ПЯ Грач", 0.650, 9.18, 8, 340, Стрелковое.ВидыСтрелкОруж.Легкое);
            var стрелк2 = new Стрелковое("USA", "Glok-17", 0.905, 9.19, 17, 375, Стрелковое.ВидыСтрелкОруж.Легкое);
            var танк1 = new Танк("Россия", "Т-90", 46.5, 125, 65, 3, Танк.ВидыТанков.Средний);
            var танк2= new Танк("USA", "Abrams", 55, 105, 72, 4, Танк.ВидыТанков.Тяжелый);
            var самолет1 = new Самолет("Россия", "СУ-27", 16, 43.5, 1, Самолет.ВидыСамолетов.Истребитель, 2500);
            var самолет2 = new Самолет("USA", "SR-71", 77, 0, 2, Самолет.ВидыСамолетов.Разведчик, 3300);

            Вооружение[] mas = {вооруж, стрелк1, стрелк2, танк1, танк2, самолет1, самолет2};

            foreach (var guns in mas)
            {
                Console.WriteLine(guns.output() + guns.Proverka);
            }

        }
    }
}